export const mistakeList = [
  "Мышление «Всё или ничего»",
  "Сверхобобщение",
  "Пессимизм",
  "Обесценивание положительного",
  "Чтение мыслей",
  "Ошибка предсказания",
  "Преувеличение/преуменьшение",
  "Эмоциональное обоснование",
  "Императивы",
  "Ярлыки",
  "Вина",
];

export const mistakeDescription = [
  {
    name: "«Всё или ничего»",
    description:
      "Этот вид когнитивных искажений описывает склонность к оценке своих личных качеств исключительно в черно-белых тонах.",
  },
  {
    name: "Сверхобобщение",
    description:
      "Вы делаете ошибочный вывод, что событие, которое произошло с вами один раз, будет повторяться снова и снова.",
  },
  {
    name: "Пессимизм",
    description:
      "Находясь в определенной ситуации, вы выбираете негативную деталь и фиксируетесь исключительно на ней, таким образом негативно воспринимая всю ситуацию в целом.",
  },
  {
    name: "Обесценивание положительного",
    description:
      "Настойчивая привычка некоторых людей в депрессии превращать нейтральный или даже позитивный опыт в негативный. Вы не просто игнорируете положительный опыт — вы быстро и умело превращаете его в кошмар.",
  },
  {
    name: "Чтение мыслей",
    description:
      "Вы делаете предположение, что другие люди смотрят на вас свысока, и настолько убеждены в этом, что даже не пытаетесь проверить это предположение.",
  },
  {
    name: "Ошибка предсказания",
    description:
      "Вы предполагаете, что произойдет что-то плохое, и принимаете это предсказание как факт, хотя оно не соответствует реальности.",
  },
  {
    name: "Преувеличение/преуменьшение",
    description:
      "Вы либо раздуваете вещи до гигантских масштабов, либо делаете их микроскопически маленькими. Обычно эффект увеличения работает, когда вы смотрите на свои собственные ошибки, страхи или недостатки, преувеличивая их важность, а когда вы думаете о своих сильных сторонах, то можете делать противоположное — преуменьшать их значимость.",
  },
  {
    name: "Эмоциональное обоснование",
    description:
      "Вы принимаете свои эмоции как доводы в пользу некой истины. Такая логика гласит: «Я чувствую себя дураком — следовательно, я дурак».",
  },
  {
    name: "Императивы",
    description:
      "Вы пытаетесь замотивировать себя, говоря: «Я должен это сделать» или «Я обязан это сделать». Эти заявления вызывают ощущение принуждения и обиды. Как ни парадоксально, в итоге вы чувствуете апатию и отсутствие мотивации.",
  },
  {
    name: "Ярлыки",
    description:
      "Навешивание на себя ярлыков, крайняя форма сверхобобщения. Вы можете подумать «Я неудачник», хотя это можно заменить на «Я допустил ошибку».",
  },
  {
    name: "Вина",
    description:
      "Вместо решения проблемы, вы ищите виноватых. В данном случае возможно обвинение других или самообвинение.",
  },
];